{
  "clips": [
    {
      "start": "00:03:00,000",
      "end": "00:03:22,000",
      "transcript_text": "my 2008 high school self just got, like, blown away, uh, with that video because it is, you know, it starts with like, \"You can communicate with, uh, people in another country.\" It's auto-translated, [laughs] and then, uh, there's this like, you know, like, uh, transparent glass panel with text popping up. Like, \"Oh, your, your thing is done. Oh, this person has this update.\" You see dashboard and everything. At that time, it was just, like, unfathomable.",
      "notes": "Emotional Up - Excitement/Discovery. This moment is compelling because it's the origin story of Hwei's passion for technology, driven by awe and curiosity. It sets up the 'magic' theme early in the arc."
    },
    {
      "start": "00:04:17,040",
      "end": "00:04:28,340",
      "transcript_text": "And I'm like, \"Whoever that is, thank you so much. You're one of the reason [laughs] why I'm here today, uh, as a data scientist and AI engineer in 2025.\" [laughs]",
      "notes": "Emotional Up - Gratitude/Destiny. A powerful and heartwarming moment of gratitude towards a stranger, directly linking her past inspiration to her current successful career. It highlights the impact of small acts of kindness and sets a positive tone after the initial discovery."
    },
    {
      "start": "00:08:41,346",
      "end": "00:08:50,376",
      "transcript_text": "it really, um, grows me as a person. I feel like... I, I feel like I've, I've grown a lot in these last 10 years.",
      "notes": "Emotional Up - Personal Growth/Reflection. This clip showcases Hwei's positive self-reflection on her personal development journey, emphasizing significant growth over a decade. It's an uplifting statement about transformation and sets a reflective tone."
    },
    {
      "start": "00:10:18,236",
      "end": "00:10:32,116",
      "transcript_text": "And so, like, I, I think this is the, the right place, um, that I'm being put in to actually grow as a person. Like, I know I am not anybody's shadow this way. I'm just me.",
      "notes": "Emotional Up - Self-Acceptance/Empowerment. Hwei directly states her personal growth and self-discovery in Germany, emphasizing becoming her authentic self and stepping out of shadows. This is a powerful, self-affirming statement."
    },
    {
      "start": "00:11:05,456",
      "end": "00:11:15,456",
      "transcript_text": "Yeah. I think no matter where you go- if you are an expat, um, you feel like the version of home that you... that, that you were familiar with but you leave, um, will just be a snapshot in the past because, I mean, Malaysia has grown so much in these recent years.",
      "notes": "Emotional Transition - Bittersweet Reflection. This clip captures the complex, bittersweet feeling of an expat, where 'home' becomes a moving target. It introduces a touch of melancholy and deep reflection on identity and belonging, serving as an emotional 'down'."
    },
    {
      "start": "00:11:51,000",
      "end": "00:12:12,000",
      "transcript_text": "what's most important is to... as long as you are feeling you, uh, and as long as you're living authentically, home is where you are. Home is not the snapshot that you're left alone with. Home is also not like j-You, you don't necessarily feel like 100% fitting in, uh, into anything.",
      "notes": "Emotional Up - Empowerment/Self-acceptance. This resolves the previous bittersweet reflection with a powerful message of self-acceptance and finding 'home' within oneself, regardless of physical location. It’s an uplifting realization, providing an emotional peak after the 'down'."
    },
    {
      "start": "00:16:31,058",
      "end": "00:16:54,180",
      "transcript_text": "when, when us just put ourself in the shoes of the consumer, of the user, and then extrapolate this presentation into what might be in the future. Um, so yeah, if you're, if anybody is thinking about, you know, \"Shit, the future is doom,\" [laughs] I can totally understand. Like, this is just a, I think the handling of the presentation into what the audience might feel like that, that, that, that can be more considerate.",
      "notes": "Emotional Down - Empathy/Concern. This clip shows Hwei's empathy for public fears around AI, particularly humanoid robots. It acknowledges a potential \"doom\" scenario, creating a moment of shared concern and highlighting the importance of ethical communication. Introduces a real-world challenge."
    },
    {
      "start": "00:19:21,520",
      "end": "00:19:43,060",
      "transcript_text": "intention really matters, and what problems are you solving and for who. Um, humans have to come up with this first and foremost, and then the tech comes in to, you know, make it, make it happen in reality. And so I think what we can control right now is whoever is needing the solution and whoever, like us, is executing or implementing these solutions, figuring out for what and for who, it's kinda our due diligence.",
      "notes": "Emotional Up - Purpose/Ethical Stance. This highlights Hwei's strong ethical framework regarding technology: prioritizing human intention and problem-solving, and the due diligence of tech practitioners. It's an inspiring call to conscious tech development after acknowledging public concerns."
    },
    {
      "start": "00:24:45,190",
      "end": "00:25:00,030",
      "transcript_text": "something that I told, told a lot of our members, our community members, is when you look back at the things that you do, even as a freelancer, content creator or whatnot, um, it's okay to feel cringe, but you don't really want to feel shame.",
      "notes": "Emotional Transition - Wisdom/Authenticity. This offers profound, relatable wisdom about navigating self-perception in work and life. It's a vulnerable yet empowering piece of advice for anyone putting themselves out there."
    },
    {
      "start": "00:26:50,000",
      "end": "00:27:05,190",
      "transcript_text": "But that tool now managed to, uh, kind of like predict pollutants in time to say like, \"Hey, when a pollutant is being detected abnormally at upstream rivers, then by this and this time, it, it's going to flow to the border to the Netherlands,\" and things like this. And so this is something that when being used correctly can really benefit maybe the lives of a region of people.",
      "notes": "Emotional Up - Impact/Pride. This clip showcases a concrete achievement with significant positive societal impact (pollutant monitoring). It's a moment of pride in her work and its real-world benefits, demonstrating her \"worthy problems\" philosophy."
    },
    {
      "start": "00:44:13,842",
      "end": "00:44:29,722",
      "transcript_text": "Yes. I told Dave, uh, in a later interview, I said, \"Uh, Dave, I didn't have confidence. I outsourced my confidence to you, and thanks to you, I'm here.\" \"I'm in the game.\" [laughs] And then-",
      "notes": "Emotional Down - Vulnerability/Overcoming doubt. A very personal and vulnerable admission about lacking confidence, coupled with the turning point of receiving support. This is a powerful \"down\" that highlights the importance of mentorship."
    },
    {
      "start": "00:44:42,492",
      "end": "00:44:55,522",
      "transcript_text": "Like, I'm like, \"I know what you need, um, based on, base- based on the fact that I'm also in the game.\" Um, and so if you, if you can leave the rest to us, and then just say, \"I want to go here,\" we'll help you get there.",
      "notes": "Emotional Up - Empowerment/Mentorship. This demonstrates Hwei's transformation from needing confidence to providing it for others. It's a powerful statement of support and belief in her mentees, showing the full circle of her journey."
    },
    {
      "start": "01:12:19,830",
      "end": "01:12:46,929",
      "transcript_text": "Three times that I have to be almost bedridden. [laughs] I'm in a lot of pain, uh, to realize, uh, I'm not supposed to do certain things. And usually, that comes in terms of, um, the career choice, um, and the environment, and, uh, my attitude trying to climbing the trees, uh, while not knowing myself.",
      "notes": "Emotional Down - Pain/Burnout/Self-realization. This is a very raw and honest account of repeated burnouts and physical pain, leading to a crucial realization about self-ignorance and misalignment in career choices. A significant low point in the narrative arc."
    },
    {
      "start": "01:15:23,994",
      "end": "01:15:55,154",
      "transcript_text": "I'm ignoring all the subtle and obvious signals- that until my body literally can't move anymore for me to say, \"Stop.\" Otherwise, I'll still keep moving. Like otherwise I wouldn't have learned this lesson. So my body was compassionate enough to take a breakdown to remind myself that, hey, this is not you. Like this is... you're not... e- you're, you're, you're a different vehicle being put on different purpose.",
      "notes": "Emotional Down - Consequence/Self-neglect. This vividly describes the painful culmination of ignoring internal signals, where her body forced a breakdown. It emphasizes the physical toll of misalignment and sets up the subsequent breakthrough."
    },
    {
      "start": "01:21:54,514",
      "end": "01:22:20,234",
      "transcript_text": "only up until two to three years ago, I used to think that my existence is to be of use by others, is to lose my shapes and forms and then putting myself down to the dust, and to just serve others, and that is love.",
      "notes": "Emotional Down - Deep Vulnerability/Past Misconception. This is a profound and vulnerable admission about a deeply ingrained, self-sacrificing belief from her past. It explains the root cause of her struggles and highlights the magnitude of her personal transformation, creating a significant 'down' before the final 'up'."
    },
    {
      "start": "01:22:45,514",
      "end": "01:23:10,054",
      "transcript_text": "shift in perspective that I am my own person. I have my shapes and forms and boundaries. This is where I end, this is where others start. [laughs] Uh, I can have my own preference. Uh, I exist in the world, therefore I have the right to interact with the world as me.",
      "notes": "Emotional Up - Breakthrough/Self-Empowerment. This is the triumphant resolution to her past struggles, articulating a profound shift in self-perception and personal empowerment. It represents the ultimate \"up\" in her emotional journey, a powerful turning point."
    },
    {
      "start": "01:25:23,534",
      "end": "01:25:41,494",
      "transcript_text": "Yeah, really, Nicola, thank you so much for inviting me to do this. Uh, I am not used to talk about myself. I hope this ends well. But in any case, I've enjoyed our conversation today. And, uh, thank you for having me.",
      "notes": "Emotional Up - Gratitude/Reflection. This serves as a warm, reflective closing statement for the interview. Hwei expresses gratitude and a slight vulnerability (\"not used to talk about myself\"), but ultimately ends on a positive and appreciative note, bringing the arc to a gentle close with a sense of accomplishment."
    }
  ]
}