{
  "clips": [
    {
      "start": "00:04:01,000",
      "end": "00:04:09,000",
      "transcript_text": "[Hwei] a stranger in the internet, that person replied that says, \"You should just go for computer science.\"",
      "notes": "Unexpected, simple advice from a stranger changed her career path."
    },
    {
      "start": "00:09:17,000",
      "end": "00:09:25,000",
      "transcript_text": "[Hwei] Germany has made space for me to know who I am as a person, what I prefer.",
      "notes": "Profound realization about self-discovery and preferences in a new environment."
    },
    {
      "start": "00:12:02,000",
      "end": "00:12:09,000",
      "transcript_text": "[Hwei] as long as you're living authentically, home is where you are.",
      "notes": "Profound realization about belonging and authenticity."
    },
    {
      "start": "00:24:47,000",
      "end": "00:24:55,000",
      "transcript_text": "[Hwei] it's okay to feel cringe, but you don't really want to feel shame.",
      "notes": "Powerful, relatable advice on professional integrity and avoiding regret."
    },
    {
      "start": "00:29:18,000",
      "end": "00:29:26,000",
      "transcript_text": "[Hwei] it's like using, um, I don't know, atomic bomb to, to... kill a mosquito, right?",
      "notes": "Controversial/unexpected take on overusing GenAI with a strong metaphor."
    },
    {
      "start": "00:44:19,842",
      "end": "00:44:26,900",
      "transcript_text": "[Hwei] I didn't have confidence. I outsourced my confidence to you.",
      "notes": "Vulnerable admission about lacking confidence and relying on a mentor."
    },
    {
      "start": "00:46:35,962",
      "end": "00:46:44,962",
      "transcript_text": "[Hwei] In my mind, every goal that you told me that you're going to achieve, I consider it done already.",
      "notes": "Inspiring coaching philosophy, demonstrating strong belief in others' potential."
    },
    {
      "start": "00:48:02,382",
      "end": "00:48:11,382",
      "transcript_text": "[Hwei] I cannot help those people who cannot believe in another version of narration.",
      "notes": "Bold and insightful statement about the limits of coaching, highlighting a common human challenge."
    },
    {
      "start": "00:57:09,506",
      "end": "00:57:17,506",
      "transcript_text": "[Hwei] righteousness is not my goal in coaching. I don't have to be right.",
      "notes": "Profound insight into an empathetic coaching philosophy, going against conventional wisdom."
    },
    {
      "start": "01:06:26,000",
      "end": "01:06:31,000",
      "transcript_text": "[Hwei] don't hug the log when you have to climb the mountain.",
      "notes": "Powerful and memorable metaphor for letting go of what no longer serves for future growth."
    },
    {
      "start": "01:11:44,000",
      "end": "01:11:53,000",
      "transcript_text": "[Hwei] you don't realize that you're a fish. This is not your lane. Go back to the water.",
      "notes": "Powerful metaphor for self-discovery and finding your true path, not comparing yourself to others."
    },
    {
      "start": "01:12:46,794",
      "end": "01:12:51,794",
      "transcript_text": "[Hwei] I have had three burnouts in the past 10 years.",
      "notes": "Vulnerable admission of personal struggle, relatable and attention-grabbing."
    },
    {
      "start": "01:14:20,000",
      "end": "01:14:26,000",
      "transcript_text": "[Hwei] I'm trying my very best just trying to survive instead of thriving.",
      "notes": "Relatable description of a common struggle and a profound insight into how many people live."
    },
    {
      "start": "01:15:39,000",
      "end": "01:15:48,000",
      "transcript_text": "[Hwei] until my body literally can't move anymore for me to say, \"Stop.\"",
      "notes": "Visceral description of hitting rock bottom due to burnout."
    },
    {
      "start": "01:21:32,954",
      "end": "01:21:40,000",
      "transcript_text": "[Hwei] I used to think that my existence is to be of use by others.",
      "notes": "Deeply vulnerable admission about past self-worth issues and a common, unhealthy belief."
    },
    {
      "start": "01:22:33,000",
      "end": "01:22:39,000",
      "transcript_text": "[Hwei] I have my shapes and forms and boundaries.",
      "notes": "Profound realization about personal identity, self-worth, and setting boundaries."
    },
    {
      "start": "01:22:50,000",
      "end": "01:22:59,000",
      "transcript_text": "[Hwei] I exist in the world, therefore I have the right to interact with the world as me.",
      "notes": "Powerful declaration of self-worth and right to authentic existence."
    }
  ]
}