{
  "clips": [
    {
      "start": "01:22:50,000",
      "end": "01:22:59,000",
      "transcript_text": "I exist in the world, therefore I have the right to interact with the world as me.",
      "notes": "Powerful declaration of self-worth and right to authentic existence, serving as an attention-grabbing hook."
    },
    {
      "start": "01:10:00,000",
      "end": "01:10:25,000",
      "transcript_text": "But I forgot to examine myself, like if that advice is made for me or not. Like, do I see myself in this, or do I have a level of understanding that this thing fits me or not? Um, and the process of doing that is then to, to find the truth slowly. And that book, The Way of Integrity, it's basically, like, explaining or practicing or making you realize what are the ways that you can find your own integrity. And so you have this inner truth as your anchor, and everything has to filter through this, and then you get a sense of clarity, um, when dealing with a lot of noise.",
      "notes": "Insight on honoring your own truth, filtering advice, and using inner truth as an anchor for clarity, connecting to the hook's theme of authentic existence."
    },
    {
      "start": "01:21:54,514",
      "end": "01:22:15,000",
      "transcript_text": "only up until two to three years ago, I used to think that my existence is to be of use by others, is to lose my shapes and forms and then putting myself down to the dust, and to just serve others, and that is love. Mm-hmm. And that is contribution. That was my thinking back then.",
      "notes": "Deeply vulnerable admission about past self-worth issues and a common, unhealthy belief, representing an emotional low point."
    },
    {
      "start": "01:15:23,994",
      "end": "01:15:31,000",
      "transcript_text": "I'm ignoring all the subtle and obvious signals- that until my body literally can't move anymore for me to say, 'Stop.'",
      "notes": "Visceral description of hitting rock bottom due to burnout, emphasizing the physical cost of self-neglect and pushing past limits."
    },
    {
      "start": "00:10:18,236",
      "end": "00:10:32,116",
      "transcript_text": "And so, like, I, I think this is the, the right place, um, that I'm being put in to actually grow as a person. Like, I know I am not anybody's shadow this way. I'm just me.",
      "notes": "Powerful self-affirmation about becoming her authentic self and stepping out of shadows, providing an emotional upswing in the narrative."
    },
    {
      "start": "00:24:45,190",
      "end": "00:25:00,030",
      "transcript_text": "something that I told, told a lot of our members, our community members, is when you look back at the things that you do, even as a freelancer, content creator or whatnot, um, it's okay to feel cringe, but you don't really want to feel shame.",
      "notes": "Memorable and practical advice on professional integrity and avoiding regret, leaving the listener to ponder this distinction and seek more insights."
    }
  ]
}